src/cf/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ШтрихкодыНоменклатуры/ManagerModule.bsl
Функция СформироватьEAN13() Экспорт
	Код = Неопределено;
	Диапазон = Неопределено;
	Диапазоны = ПолучитьМаксимальныеЗначенияКодовШтучныхШтрихкодов();
	Для Каждого СтрокаТЧ Из Диапазоны Цикл
		Код = СтрокаТЧ.Код + 1;
		Диапазон = СтрокаТЧ.Диапазон;
		Прервать;
	КонецЦикла;	
	Результат = Строка(Диапазон) + ПрефиксУзлаШтрихкода() + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Результат = Результат + КонтрольныйСимволEAN(Результат, 13);
	Возврат Результат;
КонецФункции

Функция ПолучитьМаксимальныеЗначенияКодовШтучныхШтрихкодов() Экспорт
	ДиапазоныШтучныхШтрихкодов = НастройкиДиапазоновШтрихкодов(Истина);

	ТекстЗапроса = "";
	Запросы = Новый Массив;
	Для Каждого Диапазон Из ДиапазоныШтучныхШтрихкодов Цикл
		Запросы.Добавить(
		"ВЫБРАТЬ
		|	""" + Диапазон + """ КАК Диапазон,
		|	МАКСИМУМ(ПОДСТРОКА(Штрихкоды.Штрихкод, 4, 9)) КАК КодСтрока
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод ПОДОБНО """ + Диапазон + Строка(ПрефиксУзлаШтрихкода()) + "[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]""
		|");
	КонецЦикла;
	ТекстЗапроса = СтрСоединить(Запросы, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ОписаниеТипаЧисла = ОбщегоНазначения.ОписаниеТипаЧисло(15, 0);
	
	МаксимальныеЗначения = Новый Массив;
	Для Каждого СтрокаТЧ Из РезультатЗапроса Цикл		
		Код = ОписаниеТипаЧисла.ПривестиЗначение(СтрокаТЧ.КодСтрока);
		Если Код >= 999999999 Тогда Продолжить КонецЕсли;		
		СтрокаРезультата = Новый Структура;
		СтрокаРезультата.Вставить("Код", Код);
		СтрокаРезультата.Вставить("Диапазон", СтрокаТЧ.Диапазон); 		
		МаксимальныеЗначения.Добавить(СтрокаРезультата);		
	КонецЦикла;
	
	Возврат МаксимальныеЗначения;
КонецФункции

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	Четн = 0;
	Нечетн = 0;
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если Не (Тип = 8 и Индекс = КоличествоИтераций) Тогда
			Четн = Четн + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
КонецФункции

Функция НастройкиДиапазоновШтрихкодов(Штучный = Истина) Экспорт
	Результат = Новый Массив;	
	Если Штучный Тогда
		Результат.Добавить("20");		
	Иначе // Весовой		
		Результат.Добавить("21");
		Результат.Добавить("22");
		Результат.Добавить("23");
		Результат.Добавить("24");
		Результат.Добавить("25");
		Результат.Добавить("26");
		Результат.Добавить("27");
		Результат.Добавить("28");
		Результат.Добавить("29");		
	КонецЕсли;	
	Возврат Результат;	
КонецФункции

Функция ПрефиксУзлаШтрихкода()
	Возврат 1;
КонецФункции	

Функция ПолучитьШК(Номенклатура, Характеристика = Неопределено, Серия = Неопределено) Экспорт
	ШК = "";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	                      |	ВЫБОР
	                      |		КОГДА ШтрихкодыНоменклатуры.Штрихкод = ШтрихкодыНоменклатуры.Номенклатура.Артикул
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Порядок
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	                      |	И (ШтрихкодыНоменклатуры.Характеристика = &Характеристика
	                      |			ИЛИ &Характеристика = НЕОПРЕДЕЛЕНО)
	                      |	И (ШтрихкодыНоменклатуры.Серия = &Серия
	                      |			ИЛИ &Серия = НЕОПРЕДЕЛЕНО)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Серия", Серия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ШК = Выборка.Штрихкод;
	КонецЕсли;
	Возврат ШК;
КонецФункции

// Закрепляет штрихкод за номенклатурой, не трогая чужие записи. В транзакции с исключительной управляемой
// блокировкой по ключу Штрихкод читает запись регистра: нет записи - пишет новую (штрихкод, номенклатура и серия,
// если передана); запись своя - не меняет её (иначе потерялись бы характеристика, упаковка и серия штрихкода);
// запись чужая - ничего не пишет и возвращает текст отказа. Своя - та же номенклатура, а при переданной серии -
// та же номенклатура и та же серия.
//
// Параметры:
//  Штрихкод     - Строка - штрихкод
//  Номенклатура - СправочникСсылка.Номенклатура - за кем закрепить
//  Серия        - СправочникСсылка.СерииНоменклатуры - серия штрихкода; пустая - штрихкод товара без серии
//
// Возвращаемое значение:
//  Строка - пустая, если штрихкод свободен или уже свой; иначе текст отказа «штрихкод занят»
//
Функция ЗанятьШтрихкод(Штрихкод, Номенклатура, Серия = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Штрихкод) Или Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат "";
	КонецЕсли;
	ЕстьСерия = ЗначениеЗаполнено(Серия);

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ШтрихкодыНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Штрихкод", Штрихкод);

	ТекстОтказа = "";
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Запись = СоздатьМенеджерЗаписи();
		Запись.Штрихкод = Штрихкод;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Запись.Штрихкод = Штрихкод;
			Запись.Номенклатура = Номенклатура;
			Если ЕстьСерия Тогда
				Запись.Серия = Серия;
			КонецЕсли;
			Запись.Записать(Истина);
		ИначеЕсли Запись.Номенклатура <> Номенклатура Или ЕстьСерия И Запись.Серия <> Серия Тогда
			ТекстОтказа = ТекстШтрихкодЗанят(Штрихкод, Запись.Номенклатура, Запись.Серия);
		Иначе
			// Своя запись не меняется: характеристика, упаковка и серия штрихкода сохраняются.
			ТекстОтказа = "";
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат ТекстОтказа;

КонецФункции

Функция ТекстШтрихкодЗанят(Штрихкод, Номенклатура, Серия)

	Если ЗначениеЗаполнено(Серия) Тогда
		Шаблон = НСтр("ru = 'Штрихкод %1 занят: он принадлежит товару «%2», серия «%3». Штрихкод не записан.';
			|fr = 'Le code-barres %1 est déjà utilisé par l''article « %2 », lot « %3 ». Le code-barres n''est pas enregistré.';
			|en = 'Barcode %1 is already used by item ""%2"", batch ""%3"". The barcode was not saved.';
			|es = 'El código de barras %1 ya pertenece al artículo «%2», lote «%3». El código de barras no se ha guardado.'");
		Возврат СтрШаблон(Шаблон, Штрихкод, Номенклатура, Серия);
	КонецЕсли;
	Шаблон = НСтр("ru = 'Штрихкод %1 занят: он принадлежит товару «%2». Штрихкод не записан.';
		|fr = 'Le code-barres %1 est déjà utilisé par l''article « %2 ». Le code-barres n''est pas enregistré.';
		|en = 'Barcode %1 is already used by item ""%2"". The barcode was not saved.';
		|es = 'El código de barras %1 ya pertenece al artículo «%2». El código de barras no se ha guardado.'");
	Возврат СтрШаблон(Шаблон, Штрихкод, Номенклатура);

КонецФункции
